# ['蘋果', '香蕉', '葡萄']
# []
# ['蘋果']
# ['a', 'b']
# [1, 2, 3]

# [1, 2] + ['b', 'c']

# [1, 2] * 2

# l = ['a', 'b', 'c']
# l[0]執行結果:['a']
# l[1]執行結果:['b']
# l[2]執行結果:['c']

# l = [0, 1, 2, 3, 4]
# l[0:3]=[0,1,2,]
# l[3:5]=[3,4]
# :=忽略開始或結束

# len([])
# len(['蘋果'])
# len(['a', 'b'])
# len([1, 2, 3])

# l = ['a', 'b', 'c']
# for index in range(len(l)):
#     print(l[index])
# 執行結果:
# a
# b
# c

# l = ['a', 'b', 'c']
# for element in l:
#     print(element)
# 執行結果:
# a
# b
# c

# max([])取最大
# max(['蘋果', '香蕉', '橘子'])沒意義
# max(['a', 'b'])執行結果:b
# max([1, 2, 3])執行結果:3

# min([])取最小
# min(['蘋果', '香蕉', '橘子'])沒意義
# min(['a', 'b'])執行結果:a
# min([1, 2, 3])執行結果:1

# list('abc')
# list([4, 5, 6])
# list(range(3))
# '1,2,3'.split(',')執行結果:['1','2','3']
# '2020/1/1'.split('/')執行結果:['2020,'1','1']

# img = ['1', '2', '3']
# '-'.join(img)執行結果:['1-2-3']

# l=['a','b','c']
# l[0]='A'
# l>>>['A','b','c']

# a=['1','2','3']
# b=a
# b[0]='2'
# print(a)執行結果:['2','2','3']

# l = ['a', 'b', 'c']
# a = l.copy()
# a[0] = 1
# print(a, l)執行結果:[1,'b','c'] ['a','b','c']

# l=[1,2,3]
# l.append(4)
# print(l)執行結果:[1,2,3,4]
# j = ['蘋果汁', '柳橙汁', '葡萄汁', '系統關閉']
# while True:
#     for i in range(len(j)):
#         print(f'{i+1}. {j[i]}')
#     x = int(input('請輸入編號:'))
#     if x == len(j):
#         print('系統關閉')
#         break
#     elif x > len(j) or x <= 0:
#         print('沒有這項商品')
#     else:
#         print(f'您點的商品是{j[x-1]}')