# 目前已點的餐:[]
# 1. 新增餐點
# 2. 移除餐點
# 3. 提交菜單
# 請輸入功能選項:1
# ==========================
# 1. 蘋果汁
# 2. 柳橙汁
# 3. 葡萄汁
# 請輸入餐點編號:3
# 您點的商品是:葡萄汁
# ==========================
# 目前已點的餐:['葡萄汁']
# 1. 新增餐點
# 2. 移除餐點
# 3. 提交菜單
# 請輸入功能選項:1
# ==========================
# 1. 蘋果汁
# 2. 柳橙汁
# 3. 葡萄汁
# 請輸入餐點編號:3
# 您點的商品是:葡萄汁
# ==========================
# 目前已點的餐:['葡萄汁', '葡萄汁']
# 1. 新增餐點
# 2. 移除餐點
# 3. 提交菜單
# 請輸入功能選項:1
# ==========================
# 1. 蘋果汁
# 2. 柳橙汁
# 3. 葡萄汁
# 請輸入餐點編號:
# 請輸入數字編號
# 1. 蘋果汁
# 2. 柳橙汁
# 3. 葡萄汁
# 請輸入餐點編號:3
# 您點的商品是:葡萄汁
# ==========================
# 目前已點的餐:['葡萄汁', '葡萄汁', '葡萄汁']
# 1. 新增餐點
# 2. 移除餐點
# 3. 提交菜單
# 請輸入功能選項:1
# ==========================
# 1. 蘋果汁
# 2. 柳橙汁
# 3. 葡萄汁
# 請輸入餐點編號:1
# 您點的商品是:蘋果汁
# ==========================
# 目前已點的餐:['葡萄汁', '葡萄汁', '葡萄汁', '蘋果汁']
# 1. 新增餐點
# 2. 移除餐點
# 3. 提交菜單
# 請輸入功能選項:1
# ==========================
# 1. 蘋果汁
# 2. 柳橙汁
# 3. 葡萄汁
# 請輸入餐點編號:2
# 您點的商品是:柳橙汁
# ==========================
# 目前已點的餐:['葡萄汁', '葡萄汁', '葡萄汁', '蘋果汁', '柳橙汁']
# 1. 新增餐點
# 2. 移除餐點
# 3. 提交菜單
# 請輸入功能選項:2
# ==========================
# 請輸入想移除的餐點完整名稱:柳橙汁
# 移除完成
# ==========================
# 目前已點的餐:['葡萄汁', '葡萄汁', '葡萄汁', '蘋果汁']
# 1. 新增餐點
# 2. 移除餐點
# 3. 提交菜單
# 請輸入功能選項:2
# ==========================
# 請輸入想移除的餐點完整名稱:葡萄汁
# 移除完成
# ==========================
# 目前已點的餐:['蘋果汁']
# 1. 新增餐點
# 2. 移除餐點
# 3. 提交菜單
# 請輸入功能選項:1
# ==========================
# 1. 蘋果汁
# 2. 柳橙汁
# 3. 葡萄汁
# 請輸入餐點編號:2
# 您點的商品是:柳橙汁
# ==========================
# 目前已點的餐:['蘋果汁', '柳橙汁']
# 1. 新增餐點
# 2. 移除餐點
# 3. 提交菜單
# 請輸入功能選項:1
# ==========================
# 1. 蘋果汁
# 2. 柳橙汁
# 3. 葡萄汁
# 請輸入餐點編號:1
# 您點的商品是:蘋果汁
# ==========================
# 目前已點的餐:['蘋果汁', '柳橙汁', '蘋果汁']
# 1. 新增餐點
# 2. 移除餐點
# 3. 提交菜單
# 請輸入功能選項:1
# ==========================
# 1. 蘋果汁
# 2. 柳橙汁
# 3. 葡萄汁
# 請輸入餐點編號:3
# 您點的商品是:葡萄汁
# ==========================
# 目前已點的餐:['蘋果汁', '柳橙汁', '蘋果汁', '葡萄汁']
# 1. 新增餐點
# 2. 移除餐點
# 3. 提交菜單
# 請輸入功能選項:1
# ==========================
# 1. 蘋果汁
# 2. 柳橙汁
# 3. 葡萄汁
# 請輸入餐點編號:3
# 您點的商品是:葡萄汁
# ==========================
# 目前已點的餐:['蘋果汁', '柳橙汁', '蘋果汁', '葡萄汁', '葡萄汁']
# 1. 新增餐點
# 2. 移除餐點
# 3. 提交菜單
# 請輸入功能選項:1
# ==========================
# 1. 蘋果汁
# 2. 柳橙汁
# 3. 葡萄汁
# 請輸入餐點編號:3
# 您點的商品是:葡萄汁
# ==========================
# 目前已點的餐:['蘋果汁', '柳橙汁', '蘋果汁', '葡萄汁', '葡萄汁', '葡萄汁']
# 1. 新增餐點
# 2. 移除餐點
# 3. 提交菜單
# 請輸入功能選項:3
# ==========================
# 您點的餐點為
# 蘋果汁:2
# 柳橙汁:1
# 葡萄汁:3
# 菜單已提交囉!
q = ['飯', '麵', '水']
l = []
e = ['1.新增餐點', '2.移除餐點', '3.提交菜單']
while True:
    print(f'目前已點的餐:{l}')
    for i in range(len(e)):
        print(f'{e[i]}')
    try:
        x = int(input('請輸入功能選項:'))
    except:
        print('請輸入餐點編號')
    else:
        if x == 1:
            for g in range(len(q)):
                print(f'{g+1}. {q[g]}')
            y = int(input('請輸入餐點編號'))
            print(f'您點的餐點是{q[y-1]}')
            l.append(q[y - 1])
        if x == 2:
            z = int(input('請輸入想移除的餐點編號'))
            while q[z - 1] in l:
                l.remove(q[z - 1])
        if x == 3:
            m = []
            for i in l:
                if not (i in m):
                    m.append(i)
            for i in m:
                print(f'{i}:{l.count(i)}')

            break
